ace-stratton/ES-SDK/6.0.4.sdk/espf/arch/stm32h753iit/drivers/sensors/magn_lis3mdl/LIS3MDL_MAG_driver.c
/*
 * Copyright (c) 2020-2022 EnduroSat AD. All rights reserved.
 *
 * Contents and presentations are protected world-wide.
 * Any kind of using, copying etc. is prohibited without prior permission.
 */
/**
 * @addtogroup magn_lis3mdl
 * @{
 *
 * @file     LIS3MDL_MAG_driver.c
 * @brief    LIS3MDL driver file
 *
 * @}
 *
 */

#include "LIS3MDL_MAG_driver.h"
#include "stm32h7xx_hal.h"
#include "MCU_Init.h"
#include "MX_I2C.h"



/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/

/* Imported function prototypes ----------------------------------------------*/

/* Private functions ---------------------------------------------------------*/

/************** Generic Function  *******************/

/*******************************************************************************
* Function Name   : LIS3MDL_MAG_WriteReg
* Description   : Generic Writing function. It must be fullfilled with either
*         : I2C or SPI writing function
* Input       : Register Address, Data to be written
* Output      : None
* Return      : None
*******************************************************************************/
//status_t LIS3MDL_MAG_WriteReg(void *handle, uint8_t Reg, uint8_t *Bufp, uint16_t len)
status_t LIS3MDL_MAG_WriteReg(uint8_t deviceAddress, uint8_t WriteAddr, uint8_t Data)   // iii
{
    HAL_StatusTypeDef I2C_retStat;
#if 1
    I2C_retStat = MX_I2C_Take(MX_I2C_BUS_SYSTEM,50);
    if(I2C_retStat == HAL_OK)
    {
        I2C_retStat = MX_I2C_BlockingMemWrite(MX_I2C_BUS_SENSORS, deviceAddress>>1, WriteAddr, sizeof(uint8_t), &Data, sizeof(uint8_t));

        MX_I2C_Release(MX_I2C_BUS_SYSTEM);
    }
    if(I2C_retStat != HAL_OK)
    {
        return SEN_ERROR;
    }
#else
  if ( HAL_I2C_Mem_Write(&SENSORS_I2C_HANDLER, deviceAddress, WriteAddr, 1, &Data, 1, 10))
    return SEN_ERROR;
#endif
  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name   : LIS3MDL_MAG_ReadReg
* Description   : Generic Reading function. It must be fullfilled with either
*         : I2C or SPI reading functions
* Input       : Register Address
* Output      : Data REad
* Return      : None
*******************************************************************************/
//status_t LIS3MDL_MAG_ReadReg(void *handle, uint8_t Reg, uint8_t *Bufp, uint16_t len)
status_t LIS3MDL_MAG_ReadReg(uint8_t deviceAddr, uint8_t Reg, uint8_t* Data)    // iii
{
    HAL_StatusTypeDef I2C_retStat;
#if 1
    I2C_retStat = MX_I2C_Take(MX_I2C_BUS_SYSTEM,50);
    if(I2C_retStat == HAL_OK)
    {
        I2C_retStat = MX_I2C_BlockingMemRead(MX_I2C_BUS_SENSORS, deviceAddr>>1, Reg, sizeof(uint8_t), Data, sizeof(uint8_t));

        MX_I2C_Release(MX_I2C_BUS_SYSTEM);
    }
    if(I2C_retStat != HAL_OK)
    {
        return SEN_ERROR;
    }
#else

  if ( HAL_I2C_Mem_Read(&SENSORS_I2C_HANDLER, deviceAddr, Reg, 1, Data, 1, 10))
    return SEN_ERROR;
#endif
  return SEN_SUCCESS;
}

/**************** Base Function  *******************/

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_WHO_AM_I_
* Description    : Read WHO_AM_I_BIT
* Input          : Pointer to uint8_t
* Output         : Status of WHO_AM_I_BIT
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_WHO_AM_I_(uint8_t id, uint8_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_WHO_AM_I_REG, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id , LIS3MDL_MAG_WHO_AM_I_REG, value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_WHO_AM_I_BIT_MASK; //coerce
  *value = *value >> LIS3MDL_MAG_WHO_AM_I_BIT_POSITION; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_SystemOperatingMode
* Description    : Write MD
* Input          : LIS3MDL_MAG_MD_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_SystemOperatingMode(uint8_t id, LIS3MDL_MAG_MD_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_CTRL_REG3, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id , LIS3MDL_MAG_CTRL_REG3, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_MD_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_CTRL_REG3, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_CTRL_REG3, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_SystemOperatingMode
* Description    : Read MD
* Input          : Pointer to LIS3MDL_MAG_MD_t
* Output         : Status of MD see LIS3MDL_MAG_MD_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_SystemOperatingMode(uint8_t id, LIS3MDL_MAG_MD_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_CTRL_REG3, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id , LIS3MDL_MAG_CTRL_REG3, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_MD_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_BlockDataUpdate
* Description    : Write BDU
* Input          : LIS3MDL_MAG_BDU_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_BlockDataUpdate(uint8_t id, LIS3MDL_MAG_BDU_t newValue)
{
  uint8_t value;

