ace-stratton/ES-SDK/6.0.4.sdk/espf/arch/stm32h753iit/drivers/sensors/magn_lis3mdl/LIS3MDL_MAG_driver.c
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_CTRL_REG5, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_CTRL_REG5, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_BDU_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_CTRL_REG5, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_CTRL_REG5, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_BlockDataUpdate
* Description    : Read BDU
* Input          : Pointer to LIS3MDL_MAG_BDU_t
* Output         : Status of BDU see LIS3MDL_MAG_BDU_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_BlockDataUpdate(uint8_t id, LIS3MDL_MAG_BDU_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_CTRL_REG5, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_CTRL_REG5, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_BDU_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_FullScale
* Description    : Write FS
* Input          : LIS3MDL_MAG_FS_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_FullScale(uint8_t id, LIS3MDL_MAG_FS_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_CTRL_REG2, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_CTRL_REG2, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_FS_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_CTRL_REG2, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_CTRL_REG2, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_FullScale
* Description    : Read FS
* Input          : Pointer to LIS3MDL_MAG_FS_t
* Output         : Status of FS see LIS3MDL_MAG_FS_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_FullScale(uint8_t id, LIS3MDL_MAG_FS_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_CTRL_REG2, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_CTRL_REG2, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_FS_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_OutputDataRate
* Description    : Write DO
* Input          : LIS3MDL_MAG_DO_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_OutputDataRate(uint8_t id, LIS3MDL_MAG_DO_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_CTRL_REG1, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_CTRL_REG1, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_DO_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_CTRL_REG1, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_CTRL_REG1, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_OutputDataRate
* Description    : Read DO
* Input          : Pointer to LIS3MDL_MAG_DO_t
* Output         : Status of DO see LIS3MDL_MAG_DO_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_OutputDataRate(uint8_t id, LIS3MDL_MAG_DO_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_CTRL_REG1, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_CTRL_REG1, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_DO_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : status_t LIS3MDL_MAG_Get_Magnetic(uint8_t *buff)
* Description    : Read Magnetic output register
* Input          : pointer to [uint8_t]
* Output         : Magnetic buffer uint8_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_Get_Magnetic(uint8_t id, uint8_t *buff)
{
  uint8_t i, j, k;
  uint8_t numberOfByteForDimension;

  numberOfByteForDimension = 6 / 3;

  k = 0;
  for (i = 0; i < 3; i++ )
  {
    for (j = 0; j < numberOfByteForDimension; j++ )
    {
      //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_OUTX_L + k, &buff[k], 1))
      if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_OUTX_L + k, &buff[k]) )
        return SEN_ERROR;
      k++;
    }
  }

  return SEN_SUCCESS;
}

/**************** Advanced Function  *******************/

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_SelfTest
* Description    : Write ST
* Input          : LIS3MDL_MAG_ST_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_SelfTest(uint8_t id, LIS3MDL_MAG_ST_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_CTRL_REG1, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_CTRL_REG1, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_ST_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_CTRL_REG1, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_CTRL_REG1, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

