ace-stratton/ES-SDK/6.0.4.sdk/espf/arch/stm32h753iit/drivers/sensors/magn_lis3mdl/LIS3MDL_MAG_driver.c
/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_SelfTest
* Description    : Read ST
* Input          : Pointer to LIS3MDL_MAG_ST_t
* Output         : Status of ST see LIS3MDL_MAG_ST_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_SelfTest(uint8_t id, LIS3MDL_MAG_ST_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_CTRL_REG1, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_CTRL_REG1, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_ST_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_OperatingModeXY
* Description    : Write OM
* Input          : LIS3MDL_MAG_OM_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_OperatingModeXY(uint8_t id, LIS3MDL_MAG_OM_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_CTRL_REG1, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_CTRL_REG1, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_OM_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_CTRL_REG1, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_CTRL_REG1, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_OperatingModeXY
* Description    : Read OM
* Input          : Pointer to LIS3MDL_MAG_OM_t
* Output         : Status of OM see LIS3MDL_MAG_OM_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_OperatingModeXY(uint8_t id, LIS3MDL_MAG_OM_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_CTRL_REG1, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_CTRL_REG1, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_OM_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_TemperatureSensor
* Description    : Write TEMP_EN
* Input          : LIS3MDL_MAG_TEMP_EN_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_TemperatureSensor(uint8_t id, LIS3MDL_MAG_TEMP_EN_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_CTRL_REG1, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_CTRL_REG1, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_TEMP_EN_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_CTRL_REG1, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_CTRL_REG1, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_TemperatureSensor
* Description    : Read TEMP_EN
* Input          : Pointer to LIS3MDL_MAG_TEMP_EN_t
* Output         : Status of TEMP_EN see LIS3MDL_MAG_TEMP_EN_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_TemperatureSensor(uint8_t id, LIS3MDL_MAG_TEMP_EN_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_CTRL_REG1, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_CTRL_REG1, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_TEMP_EN_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_SoftRST
* Description    : Write SOFT_RST
* Input          : LIS3MDL_MAG_SOFT_RST_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_SoftRST(uint8_t id, LIS3MDL_MAG_SOFT_RST_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_CTRL_REG2, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_CTRL_REG2, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_SOFT_RST_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_CTRL_REG2, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_CTRL_REG2, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_SoftRST
* Description    : Read SOFT_RST
* Input          : Pointer to LIS3MDL_MAG_SOFT_RST_t
* Output         : Status of SOFT_RST see LIS3MDL_MAG_SOFT_RST_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_SoftRST(uint8_t id, LIS3MDL_MAG_SOFT_RST_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_CTRL_REG2, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_CTRL_REG2, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_SOFT_RST_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_Reboot
* Description    : Write REBOOT
* Input          : LIS3MDL_MAG_REBOOT_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_Reboot(uint8_t id, LIS3MDL_MAG_REBOOT_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_CTRL_REG2, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_CTRL_REG2, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_REBOOT_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_CTRL_REG2, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_CTRL_REG2, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

