ace-stratton/ES-SDK/6.0.4.sdk/espf/arch/stm32h753iit/drivers/sensors/magn_lis3mdl/LIS3MDL_MAG_driver.c
/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_OperatingModeZ
* Description    : Read OMZ
* Input          : Pointer to LIS3MDL_MAG_OMZ_t
* Output         : Status of OMZ see LIS3MDL_MAG_OMZ_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_OperatingModeZ(uint8_t id, LIS3MDL_MAG_OMZ_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_CTRL_REG4, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_CTRL_REG4, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_OMZ_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_NewXData
* Description    : Read XDA
* Input          : Pointer to LIS3MDL_MAG_XDA_t
* Output         : Status of XDA see LIS3MDL_MAG_XDA_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_NewXData(uint8_t id, LIS3MDL_MAG_XDA_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_STATUS_REG, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_STATUS_REG, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_XDA_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_NewYData
* Description    : Read YDA
* Input          : Pointer to LIS3MDL_MAG_YDA_t
* Output         : Status of YDA see LIS3MDL_MAG_YDA_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_NewYData(uint8_t id, LIS3MDL_MAG_YDA_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_STATUS_REG, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_STATUS_REG, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_YDA_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_NewZData
* Description    : Read ZDA
* Input          : Pointer to LIS3MDL_MAG_ZDA_t
* Output         : Status of ZDA see LIS3MDL_MAG_ZDA_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_NewZData(uint8_t id, LIS3MDL_MAG_ZDA_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_STATUS_REG, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_STATUS_REG, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_ZDA_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_NewXYZData
* Description    : Read ZYXDA
* Input          : Pointer to LIS3MDL_MAG_ZYXDA_t
* Output         : Status of ZYXDA see LIS3MDL_MAG_ZYXDA_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_NewXYZData(uint8_t id, LIS3MDL_MAG_ZYXDA_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_STATUS_REG, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_STATUS_REG, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_ZYXDA_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_DataXOverrun
* Description    : Read XOR
* Input          : Pointer to LIS3MDL_MAG_XOR_t
* Output         : Status of XOR see LIS3MDL_MAG_XOR_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_DataXOverrun(uint8_t id, LIS3MDL_MAG_XOR_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_STATUS_REG, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_STATUS_REG, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_XOR_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_DataYOverrun
* Description    : Read YOR
* Input          : Pointer to LIS3MDL_MAG_YOR_t
* Output         : Status of YOR see LIS3MDL_MAG_YOR_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_DataYOverrun(uint8_t id, LIS3MDL_MAG_YOR_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_STATUS_REG, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_STATUS_REG, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_YOR_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_DataZOverrun
* Description    : Read ZOR
* Input          : Pointer to LIS3MDL_MAG_ZOR_t
* Output         : Status of ZOR see LIS3MDL_MAG_ZOR_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_DataZOverrun(uint8_t id, LIS3MDL_MAG_ZOR_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_STATUS_REG, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_STATUS_REG, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_ZOR_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_DataXYZOverrun
* Description    : Read ZYXOR
* Input          : Pointer to LIS3MDL_MAG_ZYXOR_t
* Output         : Status of ZYXOR see LIS3MDL_MAG_ZYXOR_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_DataXYZOverrun(uint8_t id, LIS3MDL_MAG_ZYXOR_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_STATUS_REG, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_STATUS_REG, (uint8_t *)value) )
    return SEN_ERROR;

