ace-stratton/ES-SDK/6.0.4.sdk/espf/arch/stm32h753iit/drivers/sensors/magn_lis3mdl/LIS3MDL_MAG_driver.c
  *value &= LIS3MDL_MAG_ZYXOR_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_InterruptEnable
* Description    : Write IEN
* Input          : LIS3MDL_MAG_IEN_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_InterruptEnable(uint8_t id, LIS3MDL_MAG_IEN_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_CFG, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_CFG, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_IEN_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_INT_CFG, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_INT_CFG, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_InterruptEnable
* Description    : Read IEN
* Input          : Pointer to LIS3MDL_MAG_IEN_t
* Output         : Status of IEN see LIS3MDL_MAG_IEN_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_InterruptEnable(uint8_t id, LIS3MDL_MAG_IEN_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_CFG, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_CFG, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_IEN_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_LatchInterruptRq
* Description    : Write LIR
* Input          : LIS3MDL_MAG_LIR_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_LatchInterruptRq(uint8_t id, LIS3MDL_MAG_LIR_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_CFG, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_CFG, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_LIR_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_INT_CFG, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_INT_CFG, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_LatchInterruptRq
* Description    : Read LIR
* Input          : Pointer to LIS3MDL_MAG_LIR_t
* Output         : Status of LIR see LIS3MDL_MAG_LIR_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_LatchInterruptRq(uint8_t id, LIS3MDL_MAG_LIR_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_CFG, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_CFG, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_LIR_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_InterruptActive
* Description    : Write IEA
* Input          : LIS3MDL_MAG_IEA_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_InterruptActive(uint8_t id, LIS3MDL_MAG_IEA_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_CFG, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_CFG, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_IEA_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_INT_CFG, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_INT_CFG, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_InterruptActive
* Description    : Read IEA
* Input          : Pointer to LIS3MDL_MAG_IEA_t
* Output         : Status of IEA see LIS3MDL_MAG_IEA_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_InterruptActive(uint8_t id, LIS3MDL_MAG_IEA_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_CFG, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_CFG, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_IEA_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_InterruptOnZ
* Description    : Write ZIEN
* Input          : LIS3MDL_MAG_ZIEN_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_InterruptOnZ(uint8_t id, LIS3MDL_MAG_ZIEN_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_CFG, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_CFG, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_ZIEN_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_INT_CFG, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_INT_CFG, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_InterruptOnZ
* Description    : Read ZIEN
* Input          : Pointer to LIS3MDL_MAG_ZIEN_t
* Output         : Status of ZIEN see LIS3MDL_MAG_ZIEN_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_InterruptOnZ(uint8_t id, LIS3MDL_MAG_ZIEN_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_CFG, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_CFG, (uint8_t *)value) )
    return SEN_ERROR;

