ace-stratton/ES-SDK/6.0.4.sdk/espf/arch/stm32h753iit/drivers/sensors/magn_lis3mdl/LIS3MDL_MAG_driver.c
  *value &= LIS3MDL_MAG_ZIEN_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_InterruptOnY
* Description    : Write YIEN
* Input          : LIS3MDL_MAG_YIEN_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_InterruptOnY(uint8_t id, LIS3MDL_MAG_YIEN_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_CFG, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_CFG, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_YIEN_MASK;
  value |= newValue;

//  if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_INT_CFG, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_INT_CFG, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_InterruptOnY
* Description    : Read YIEN
* Input          : Pointer to LIS3MDL_MAG_YIEN_t
* Output         : Status of YIEN see LIS3MDL_MAG_YIEN_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_InterruptOnY(uint8_t id, LIS3MDL_MAG_YIEN_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_CFG, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_CFG, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_YIEN_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_InterruptOnX
* Description    : Write XIEN
* Input          : LIS3MDL_MAG_XIEN_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_InterruptOnX(uint8_t id, LIS3MDL_MAG_XIEN_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_CFG, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_CFG, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_XIEN_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_INT_CFG, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_INT_CFG, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_InterruptOnX
* Description    : Read XIEN
* Input          : Pointer to LIS3MDL_MAG_XIEN_t
* Output         : Status of XIEN see LIS3MDL_MAG_XIEN_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_InterruptOnX(uint8_t id, LIS3MDL_MAG_XIEN_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_CFG, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_CFG, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_XIEN_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_InterruptFlag
* Description    : Write INT
* Input          : LIS3MDL_MAG_INT_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_InterruptFlag(uint8_t id, LIS3MDL_MAG_INT_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_SRC, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_SRC, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_INT_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_INT_SRC, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_INT_SRC, value) )

    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_InterruptFlag
* Description    : Read INT
* Input          : Pointer to LIS3MDL_MAG_INT_t
* Output         : Status of INT see LIS3MDL_MAG_INT_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_InterruptFlag(uint8_t id, LIS3MDL_MAG_INT_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_SRC, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_SRC, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_INT_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_MagneticFieldOverflow
* Description    : Write MROI
* Input          : LIS3MDL_MAG_MROI_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_MagneticFieldOverflow(uint8_t id, LIS3MDL_MAG_MROI_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_SRC, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_SRC, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_MROI_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_INT_SRC, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_INT_SRC, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_MagneticFieldOverflow
* Description    : Read MROI
* Input          : Pointer to LIS3MDL_MAG_MROI_t
* Output         : Status of MROI see LIS3MDL_MAG_MROI_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_MagneticFieldOverflow(uint8_t id, LIS3MDL_MAG_MROI_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_SRC, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_SRC, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_MROI_MASK; //mask

  return SEN_SUCCESS;
}

