ace-stratton/ES-SDK/6.0.4.sdk/espf/arch/stm32h753iit/drivers/sensors/magn_lis3mdl/LIS3MDL_MAG_driver.c
/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_NegativeThresholdFlagZ
* Description    : Write NTH_Z
* Input          : LIS3MDL_MAG_NTH_Z_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_NegativeThresholdFlagZ(uint8_t id, LIS3MDL_MAG_NTH_Z_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_SRC, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_SRC, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_NTH_Z_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_INT_SRC, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_INT_SRC, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_NegativeThresholdFlagZ
* Description    : Read NTH_Z
* Input          : Pointer to LIS3MDL_MAG_NTH_Z_t
* Output         : Status of NTH_Z see LIS3MDL_MAG_NTH_Z_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_NegativeThresholdFlagZ(uint8_t id, LIS3MDL_MAG_NTH_Z_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_SRC, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_SRC, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_NTH_Z_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_NegativeThresholdFlagY
* Description    : Write NTH_Y
* Input          : LIS3MDL_MAG_NTH_Y_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_NegativeThresholdFlagY(uint8_t id, LIS3MDL_MAG_NTH_Y_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_SRC, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_SRC, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_NTH_Y_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_INT_SRC, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_INT_SRC, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_NegativeThresholdFlagY
* Description    : Read NTH_Y
* Input          : Pointer to LIS3MDL_MAG_NTH_Y_t
* Output         : Status of NTH_Y see LIS3MDL_MAG_NTH_Y_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_NegativeThresholdFlagY(uint8_t id, LIS3MDL_MAG_NTH_Y_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_SRC, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_SRC, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_NTH_Y_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_NegativeThresholdFlagX
* Description    : Write NTH_X
* Input          : LIS3MDL_MAG_NTH_X_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_NegativeThresholdFlagX(uint8_t id, LIS3MDL_MAG_NTH_X_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_SRC, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_SRC, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_NTH_X_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_INT_SRC, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_INT_SRC, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_NegativeThresholdFlagX
* Description    : Read NTH_X
* Input          : Pointer to LIS3MDL_MAG_NTH_X_t
* Output         : Status of NTH_X see LIS3MDL_MAG_NTH_X_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_NegativeThresholdFlagX(uint8_t id, LIS3MDL_MAG_NTH_X_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_SRC, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_SRC, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_NTH_X_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_PositiveThresholdFlagZ
* Description    : Write PTH_Z
* Input          : LIS3MDL_MAG_PTH_Z_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_PositiveThresholdFlagZ(uint8_t id, LIS3MDL_MAG_PTH_Z_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_SRC, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_SRC, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_PTH_Z_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_INT_SRC, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_INT_SRC, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_PositiveThresholdFlagZ
* Description    : Read PTH_Z
* Input          : Pointer to LIS3MDL_MAG_PTH_Z_t
* Output         : Status of PTH_Z see LIS3MDL_MAG_PTH_Z_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_PositiveThresholdFlagZ(uint8_t id, LIS3MDL_MAG_PTH_Z_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_SRC, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_SRC, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_PTH_Z_MASK; //mask

  return SEN_SUCCESS;
}

