ace-stratton/ES-SDK/6.0.4.sdk/espf/arch/stm32h753iit/drivers/sensors/magn_lis3mdl/LIS3MDL_MAG_driver.c
/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_PositiveThresholdFlagY
* Description    : Write PTH_Y
* Input          : LIS3MDL_MAG_PTH_Y_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_PositiveThresholdFlagY(uint8_t id, LIS3MDL_MAG_PTH_Y_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_SRC, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_SRC, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_PTH_Y_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_INT_SRC, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_INT_SRC, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_PositiveThresholdFlagY
* Description    : Read PTH_Y
* Input          : Pointer to LIS3MDL_MAG_PTH_Y_t
* Output         : Status of PTH_Y see LIS3MDL_MAG_PTH_Y_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_PositiveThresholdFlagY(uint8_t id, LIS3MDL_MAG_PTH_Y_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_SRC, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_SRC, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_PTH_Y_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_W_PositiveThresholdFlagX
* Description    : Write PTH_X
* Input          : LIS3MDL_MAG_PTH_X_t
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t  LIS3MDL_MAG_W_PositiveThresholdFlagX(uint8_t id, LIS3MDL_MAG_PTH_X_t newValue)
{
  uint8_t value;

  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_SRC, &value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_SRC, &value) )
    return SEN_ERROR;

  value &= ~LIS3MDL_MAG_PTH_X_MASK;
  value |= newValue;

  //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_INT_SRC, &value, 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_INT_SRC, value) )
    return SEN_ERROR;

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : LIS3MDL_MAG_R_PositiveThresholdFlagX
* Description    : Read PTH_X
* Input          : Pointer to LIS3MDL_MAG_PTH_X_t
* Output         : Status of PTH_X see LIS3MDL_MAG_PTH_X_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_R_PositiveThresholdFlagX(uint8_t id, LIS3MDL_MAG_PTH_X_t *value)
{
  //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_SRC, (uint8_t *)value, 1) )
  if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_INT_SRC, (uint8_t *)value) )
    return SEN_ERROR;

  *value &= LIS3MDL_MAG_PTH_X_MASK; //mask

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : status_t LIS3MDL_MAG_Get_Temperature(uint8_t *buff)
* Description    : Read Temperature output register
* Input          : pointer to [uint8_t]
* Output         : Temperature buffer uint8_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_Get_Temperature(uint8_t id, uint8_t *buff)
{
  uint8_t i, j, k;
  uint8_t numberOfByteForDimension;

  numberOfByteForDimension = 2 / 1;

  k = 0;
  for (i = 0; i < 1; i++ )
  {
    for (j = 0; j < numberOfByteForDimension; j++ )
    {
      //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_TEMP_OUT_L + k, &buff[k], 1))
      if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_TEMP_OUT_L + k, &buff[k]) )
        return SEN_ERROR;
      k++;
    }
  }

  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : status_t LIS3MDL_MAG_Set_MagneticThreshold(uint8_t *buff)
* Description    : Set MagneticThreshold data row
* Input          : pointer to [uint8_t]
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_Set_MagneticThreshold(uint8_t id, uint8_t *buff)
{
  uint8_t  i;

  for (i = 0; i < 2; i++ )
  {
    //if( !LIS3MDL_MAG_WriteReg(handle, LIS3MDL_MAG_INT_THS_L + i,  &buff[i], 1) )
  if( !LIS3MDL_MAG_WriteReg(id , LIS3MDL_MAG_INT_THS_L + i, buff[i]) )
      return SEN_ERROR;
  }
  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : status_t LIS3MDL_MAG_Get_MagneticThreshold(uint8_t *buff)
* Description    : Read MagneticThreshold output register
* Input          : pointer to [uint8_t]
* Output         : MagneticThreshold buffer uint8_t
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t LIS3MDL_MAG_Get_MagneticThreshold(uint8_t id, uint8_t *buff)
{
  uint8_t i, j, k;
  uint8_t numberOfByteForDimension;

  numberOfByteForDimension = 2 / 1;

  k = 0;
  for (i = 0; i < 1; i++ )
  {
    for (j = 0; j < numberOfByteForDimension; j++ )
    {
      //if( !LIS3MDL_MAG_ReadReg(handle, LIS3MDL_MAG_INT_THS_L + k, &buff[k], 1))
      if( !LIS3MDL_MAG_ReadReg(id, LIS3MDL_MAG_TEMP_OUT_L + k, &buff[k]) )
        return SEN_ERROR;
      k++;
    }
  }

  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name   : SwapHighLowByte
* Description   : Swap High/low byte in multiple byte values
*                     It works with minimum 2 byte for every dimension.
*                     Example x,y,z with 2 byte for every dimension
*
* Input       : bufferToSwap -> buffer to swap
*                     numberOfByte -> the buffer length in byte
*                     dimension -> number of dimension
*
* Output      : bufferToSwap -> buffer swapped
* Return      : None
*******************************************************************************/
void LIS3MDL_MAG_SwapHighLowByte(uint8_t *bufferToSwap, uint8_t numberOfByte, uint8_t dimension)
{
  uint8_t numberOfByteForDimension, i, j;
  uint8_t tempValue[10];

  numberOfByteForDimension = numberOfByte / dimension;

  for (i = 0; i < dimension; i++ )
  {
    for (j = 0; j < numberOfByteForDimension; j++ )
      tempValue[j] = bufferToSwap[j + i * numberOfByteForDimension];
    for (j = 0; j < numberOfByteForDimension; j++ )
      *(bufferToSwap + i * (numberOfByteForDimension) + j) = *(tempValue + (numberOfByteForDimension - 1) - j);
  }
}
